# 序列的定义:内容连续\有序,可使用下标索引的一类数据容器
# 列表,元组,字符串均可以视为序列
# 切片的定义:从一个序列中取出一个子序列

# 语法:序列[起始下标:结束下表:步长]
# 起始下标表示从何处开始，可以留空，留空视作从头开始
# 结束下标(不含)表示何处结束，可以留空，留空视作截取到结尾
# 步长可以为负数，表示反向取值
# NOTE 对序列的切片并不影响原序列，而是新建一个序列

# 对list进行切片，从1开始，4结束，步长1
my_list = [0, 1, 2, 3, 4, 5 ,6]
result1 = my_list[1:4]
print(f"结果1：{result1}")

# 对tuple进行切片，从头开始，到最后结束，步长1
my_tuple = (0, 1, 2, 3, 4, 5, 6)
result2 = my_tuple[:]
print(f"结果2：{result2}")

# 对str进行切片，从头开始，到最后结束，步长2
my_str = "01234567"
result3 = my_str[::2]
print(f"结果3：{result3}")

# 对str进行切片，从头开始，到最后结束，步长-1
my_str = "01234567"
result4 = my_str[::-1]
print(f"结果4：{result4}")

# 对列表进行切片，从3开始，到1结束，步长-1
my_list = [0, 1, 2, 3, 4, 5, 6]
result5 = my_list[3:1:-1]
print(f"结果5：{result5}")
