# 字典中存储的数据最特别的地方在于它们始终以键值对的方式存储

# 定义字典
my_dict1 = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77}

# 定义空字典
# 定义空集合时必须通过set()的原因是{}的方式被定义空字典占用了
my_dict2 = {}
my_dict3 = dict()
print(f"字典1的内容是:{my_dict1},类型:{type(my_dict1)}")
print(f"字典2的内容是:{my_dict2},类型:{type(my_dict2)}")
print(f"字典3的内容是:{my_dict3},类型:{type(my_dict3)}")

# 定义重复key的字典
# my_dict1 = {"王力宏": 99, "王力宏": 88, "林俊杰": 77}
# print(f"重复key的字典的内容是:{my_dict1}")

# 从字典中基于key获得value
my_dict1 = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77}
score = my_dict1["王力宏"]
print(f"王力宏的考试分数是:{score}")


# 字典的嵌套
# 字典的key和walue可以是任意数据类型(key不可为字典)
# 字典是可以嵌套的
stu_score_dict = {
    "王力宏": {
        "语文": 77,
        "数学": 66,
        "英语": 33,
    },
    "周杰伦": {
        "语文": 88,
        "数学": 86,
        "英语": 55,
    },
    "林俊杰": {
        "语文": 99,
        "数学": 96,
        "英语": 66
    }
}
print(f"学生的考试信息是：{stu_score_dict}")

# 从字典中取出周杰伦的语文成绩
score = stu_score_dict["周杰伦"]["语文"]
print(f"周杰伦的语文成绩为：{score}")
